app/controllers/passwords_controller.rb

  def update
    if params[:password][:password] == params[:password][:confirmation]
      @password = Password.all.first
      @password.digest = Digest::SHA1.base64digest params[:password][:password]
      @password.save
---
SELECT `passwords`.* FROM `passwords` ORDER BY `passwords`.`id` ASC LIMIT 1
UPDATE `passwords` SET `digest` = 'vbSA3mVapux1ygWMhJxPrzwPdbE=', `updated_at` = '2015-06-08 14:31:07' WHERE `passwords`.`id` = 1