app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at desc")
---
SELECT `posts`.* FROM `posts` ORDER BY created_at desc

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def show_url
    @post = Post.where(:url => params[:post_url]).first
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`url` = 'some-more-sample-title' ORDER BY `posts`.`id` ASC LIMIT 1

  def create
    _url = params[:post][:title].downcase.gsub(/\s/, '-').gsub(/[^0-9A-Za-z\-]/, '')
    _content = params[:post][:content]
    @post = Post.create(title: params[:post][:title], content: _content, url: _url)
---
INSERT INTO `posts` (`content`, `created_at`, `title`, `updated_at`, `url`) VALUES ('Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', '2015-06-11 20:45:56', 'Some more sample title', '2015-06-11 20:45:56', 'some-more-sample-title')

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def update
    @post = Post.find(params[:id])
    @post.title = params[:post][:title]
    @post.content = params[:post][:content]
    if @post.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `content` = 'Some test content. And some more test content. And even more!', `updated_at` = '2015-06-08 01:43:40' WHERE `posts`.`id` = 2

  def destroy
    Post.find(params[:id]).destroy
    @posts = Post.all.order("created_at desc")
---
DELETE FROM `posts` WHERE `posts`.`id` = 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` ORDER BY created_at desc

  def choose_revert
    @backups = Backup.order("created_at desc").all
---
SELECT `backups`.* FROM `backups` ORDER BY created_at desc

  def revert
    backup = Backup.find(params[:backup_id])
---
SELECT `backups`.* FROM `backups` WHERE `backups`.`id` = 1 LIMIT 1