app/controllers/session_controller.rb

SELECT `passwords`.* FROM `passwords` ORDER BY `passwords`.`id` ASC LIMIT 1
---
  def create
    attempted_pass = Digest::SHA1.base64digest params[:password][:password]
    if attempted_pass == Password.all.first.digest