app/controllers/static_pages_controller.rb

SELECT `blurbs`.* FROM `blurbs` WHERE `blurbs`.`page` = 'About' ORDER BY `blurbs`.`id` ASC LIMIT 1
---
  def about
    @blurb = Blurb.where(:page => "About").first

SELECT `blurbs`.* FROM `blurbs` WHERE `blurbs`.`page` = 'Contact' ORDER BY `blurbs`.`id` ASC LIMIT 1
---
  def contact
    @blurb = Blurb.where(:page => "Contact").first

SELECT `blurbs`.* FROM `blurbs` WHERE `blurbs`.`id` = 1 LIMIT 1
UPDATE `blurbs` SET `content` = 'New about blurb.', `updated_at` = '2015-06-10 21:23:04' WHERE `blurbs`.`id` = 1
---
  def update
    @blurb = Blurb.find(params[:id])
    @blurb.content = params[:blurb][:content]
    @blurb.save